name: "N_Bandit"
input: "dummy"
input_shape {
  dim: 1
  dim: 1
  dim: 1
  dim: 1
}
input: "reward"
input_shape {
  dim: 1
  dim: 3
  dim: 1
  dim: 1
}
layer {
  name: "ip"
  type: "InnerProduct"
  bottom: "dummy"
  top: "pred"
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 3
    bias_term: false
    weight_filler {
    	type: "constant"
    	value: 0
    }
  }
}
layer {
  name: "action"
  type: "ArgMax"
  bottom: "pred"
  top: "action"
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "pred"
  bottom: "reward"
  top: "loss"
}

