name: "N_Bandit"
input: "dummy"
input_shape {
  dim: 1
  dim: 1
  dim: 1
  dim: 1
}
layer {
  name: "ip"
  type: "InnerProduct"
  botoom: "dummy"
  top: "pred"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    bias_term: false
  }
}
layer {
  name: "loss"
  type: "EucideanLoss"
  bottom: "pred"
  bottom: "reward"
  top: "loss"
}
